Alexislilei/matter-thermostat/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_MBEDTLS_HKDF_C=y

# 自定义分区表 (8MB Flash, factory 3MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# BLE 配网支持 (Matter BLE Commissioning)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_CTRL_MODE_EFF=1

# 解决 IRAM 溢出：将 WiFi 和 NimBLE IRAM 优化代码移到 Flash
# 避免 iram0_0_seg overflow (BLE 占用了额外 IRAM)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_BT_NIMBLE_HOST_IRAM_OPT=n

# 崩溃诊断配置
# 1) 启用 Core Dump 到 Flash：崩溃时保存精确调用栈，重启后用
#    `idf.py coredump-info` 解码定位崩溃位置（需在 partitions.csv 中
#    添加 coredump 分区）。
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
# 2) 崩溃后延迟 5 秒再重启，确保串口日志完整输出，避免错过崩溃瞬间信息
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=5

# LVGL 字体配置 (LCD UI 使用)
# 顶部信息栏用 20 (原14的1.5倍)；TEMP 标签用 16；HEAT/TIMER 底部状态栏用 24 (原16的1.5倍)；
# 设定温度用 40 (原20的2倍)；主页面大字/STANDBY 用 48 (原32的2倍)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# SNTP 时间同步配置
# 1) 允许 4 个 SNTP 服务器 (2 个域名 + 2 个 IP，IP 可绕过 DNS 解析失败)
CONFIG_LWIP_SNTP_MAX_SERVERS=4
# 2) 缩短 SNTP 重试间隔 (15 秒，Kconfig 允许的最小值)。默认 1 小时，
#    若首次同步时 Wi-Fi 尚未连接，会导致时间长时间停留在占位符；
#    缩短后可在网络就绪后快速重试同步。
CONFIG_LWIP_SNTP_UPDATE_DELAY=15000
